In [1]:
import pandas as pd;

In [2]:
data = {
    'name':['vishal', 'om', 'Shubz', 'aditi'],
    'age':[21,22,22,21],
    'salary':[50000,44000,30000,22222],
    'department':['Computer', 'chemical', 'computer IT', 'Al ML']
}

Data = pd.DataFrame(data)
Data

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT
3   aditi   21   22222        Al ML

In [5]:
Data[['name', 'age']]

     name  age
0  vishal   21
1      om   22
2   Shubz   22
3   aditi   21

In [7]:
Data.loc[Data.name == 'vishal']

     name  age  salary department
0  vishal   21   50000   Computer

In [8]:
Data.loc[(Data.name == 'vishal') & (Data.age >= 21)]

     name  age  salary department
0  vishal   21   50000   Computer

In [9]:
Data.loc[ : 2]

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT

In [10]:
Data.iloc[ : 2]

     name  age  salary department
0  vishal   21   50000   Computer
1      om   22   44000   chemical

In [11]:
data

{'name': ['vishal', 'om', 'Shubz', 'aditi'],
 'age': [21, 22, 22, 21],
 'salary': [50000, 44000, 30000, 22222],
 'department': ['Computer', 'chemical', 'computer IT', 'Al ML']}

In [12]:
Data

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT
3   aditi   21   22222        Al ML

In [13]:
Data.to_csv('new_data', index=False)

In [14]:
load = pd.read_csv('new_data')
load

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT
3   aditi   21   22222        Al ML

In [16]:
Data[['name', 'age']]

     name  age
0  vishal   21
1      om   22
2   Shubz   22
3   aditi   21

In [17]:
Data.loc[Data.name == 'vishal']

     name  age  salary department
0  vishal   21   50000   Computer

In [18]:
Data.loc[ : 2]

     name  age  salary   department
0  vishal   21   50000     Computer
1      om   22   44000     chemical
2   Shubz   22   30000  computer IT

In [19]:
Data.iloc[ : 2]

     name  age  salary department
0  vishal   21   50000   Computer
1      om   22   44000   chemical